# Filtering and selection

For series and dataFrame we tried to use CRUD operations
C - Create
R - Read
U - Update
D - Delete

In [80]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series

# Series

In [81]:
print(np.arange(5)) # return a nd array with given range and step values
print(type(np.arange(5))) # type is numpy ndarray
print(np.arange(5).ndim)# initiall dimensions is 1

[0 1 2 3 4]
<class 'numpy.ndarray'>
1

Creating a Series

In [82]:
# To create a series
#one way ['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6','row 7', 'row 8']
#another way
index_list = ["row " + str(i) for i in range(1,9)]
series = Series(np.arange(8), index_list)
series

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

In [83]:
print(type(series))

<class 'pandas.core.series.Series'>

Reading a Series

accessing the elements in two way
1. using named index
2. using index number

In [84]:
# using index number
print(series[5], series[3], sep = '\n')

5
3

In [85]:
# using named index
print(series["row 2"], series["row 5"], sep = '\n')

1
4

In [86]:
# accessing multiple elements 
print(series[[1,2]]) # using index number
print(series[['row 1','row 2']]) # using index names
# values of index 1 and index 2

row 2    1
row 3    2
dtype: int32
row 1    0
row 2    1
dtype: int32

# slicing

In [87]:
# series slicing
series[2:5]

row 3    2
row 4    3
row 5    4
dtype: int32

In [88]:
series[::2]

row 1    0
row 3    2
row 5    4
row 7    6
dtype: int32

Updating Series

In [89]:
# setting new values for
series[[2,4]] = 2424
print(series)
print(series.dtype)

row 1       0
row 2       1
row 3    2424
row 4       3
row 5    2424
row 6       5
row 7       6
row 8       7
dtype: int32
int32

In [90]:
# which are the elements divisible by 2 replace with even and rest with odd
# for i in range(len(series)):
#     if i % 2 == 0:
#         series[i] = "even"
#     else:
#         series[i] = "odd"
#KeyEror , ValueError

In [91]:
series = series.astype("string")# before changing values, we need to make sure that 
# series data elements supports the data type if not we need to change according.

# # which are the elements divisible by 2 replace with even and rest with odd
for i in range(len(series)):
    if i % 2 == 0:
        series[i] = "even"
    else:
        series[i] = "odd"
print(series)

row 1    even
row 2     odd
row 3    even
row 4     odd
row 5    even
row 6     odd
row 7    even
row 8     odd
dtype: string

In [92]:
# adding new values to series
series2 = pd.Series({" row 9": "new"})
series = series.append(series2)

C:\Users\mahes\AppData\Local\Temp\ipykernel_28968\1860557422.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series = series.append(series2)

In [93]:
# series = pd.concat([pd.Series({"row 10" : "new"}), series])

In [94]:
series3 = pd.Series({"row 10": "new"})
series = pd.concat([series,series3])

In [95]:
series

row 1     even
row 2      odd
row 3     even
row 4      odd
row 5     even
row 6      odd
row 7     even
row 8      odd
 row 9     new
row 10     new
dtype: object

Deleting a Series

In [96]:
series.drop(" row 9", inplace = True)
# inplace is used to change the original series or data frame

In [97]:
series = series.astype("string")

In [98]:
series

row 1     even
row 2      odd
row 3     even
row 4      odd
row 5     even
row 6      odd
row 7     even
row 8      odd
row 10     new
dtype: string

# DataFrame

Creating a DataFrame

In [99]:
# creation
index = ["row " + str(i) for i in range(1,7)]
column = ["col " + str(i) for i in range(1,7)]
np.random.seed(25) # seed is used to fix the random data
df = DataFrame(np.random.rand(36).reshape(6,6),
      index = index,
      columns = column)
df

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [100]:
type(df)

pandas.core.frame.DataFrame

Reading a DataFrame

In [101]:
# Read
# accessing columns using column name
print(df['col 1'], df['col 2'], sep = '\n')

row 1    0.870124
row 2    0.684969
row 3    0.447031
row 4    0.366395
row 5    0.514244
row 6    0.281701
Name: col 1, dtype: float64
row 1    0.582277
row 2    0.437611
row 3    0.585445
row 4    0.836375
row 5    0.559053
row 6    0.900274
Name: col 2, dtype: float64

In [102]:
type(df['col 1']) # single column is considered as series

pandas.core.series.Series

In [103]:
df.loc["row 1"]

col 1    0.870124
col 2    0.582277
col 3    0.278839
col 4    0.185911
col 5    0.411100
col 6    0.117376
Name: row 1, dtype: float64

In [104]:
type(df.loc['row 1']) # single row is also considered as a series

pandas.core.series.Series

In [105]:
# New data frame with no index and no col
np.random.seed(25)
df2 = DataFrame(np.random.rand(16).reshape(4,4))
# if no index and columns specified by default it takes
# range of values from 0

In [106]:
df2

          0         1         2         3
0  0.870124  0.582277  0.278839  0.185911
1  0.411100  0.117376  0.684969  0.437611
2  0.556229  0.367080  0.402366  0.113041
3  0.447031  0.585445  0.161985  0.520719

In [107]:
df2.loc[3] # to access row

0    0.447031
1    0.585445
2    0.161985
3    0.520719
Name: 3, dtype: float64

In [108]:
df2[2] # to access column

0    0.278839
1    0.684969
2    0.402366
3    0.161985
Name: 2, dtype: float64

conclusion: 
    if we don't have index names/ row names we could use index numbers
    if we do have index names/row names we ought to use respective names

In [109]:
df.loc[['row 1','row 3']]

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186

Deleting a DataFrame

In [110]:
df.drop('row 5')# row 5 is dropped

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [111]:
df # it didn't impacted on original data set

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [112]:
df.drop('row 5',inplace = True)

In [113]:
df # row 5 is dropped

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [114]:
del df['col 4'] #col 4 got deleted

In [115]:
df

          col 1     col 2     col 3     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.383048  0.997541
row 6  0.281701  0.900274  0.669612  0.289804  0.525819

In [116]:
df.pop('col 5') # col 5 got popped

row 1    0.411100
row 2    0.402366
row 3    0.326051
row 4    0.383048
row 6    0.289804
Name: col 5, dtype: float64

In [117]:
df

          col 1     col 2     col 3     col 6
row 1  0.870124  0.582277  0.278839  0.117376
row 2  0.684969  0.437611  0.556229  0.113041
row 3  0.447031  0.585445  0.161985  0.699186
row 4  0.366395  0.836375  0.481343  0.997541
row 6  0.281701  0.900274  0.669612  0.525819

In [118]:
df <= 0.5

       col 1  col 2  col 3  col 6
row 1  False  False   True   True
row 2  False   True  False   True
row 3   True  False   True  False
row 4   True  False   True  False
row 6   True  False  False  False

In [119]:
df[df <= .4]

          col 1  col 2     col 3     col 6
row 1       NaN    NaN  0.278839  0.117376
row 2       NaN    NaN       NaN  0.113041
row 3       NaN    NaN  0.161985       NaN
row 4  0.366395    NaN       NaN       NaN
row 6  0.281701    NaN       NaN       NaN

In [120]:
del df

In [121]:
# df
# NameError: name 'df' is not defined

# Previous

In [122]:
import pandas as pd
import numpy as np

In [123]:
from pandas import Series, DataFrame

In [124]:
series_obj = Series(np.arange(8), index = ['row1', 'row2', 'row3', 'row4','row5', 'row6', 'row7', 'row8'])
series_obj

row1    0
row2    1
row3    2
row4    3
row5    4
row6    5
row7    6
row8    7
dtype: int32

In [125]:
# getting using index names
series_obj['row6']

5

In [126]:
series_obj['row4']

3

In [127]:
# by index numbers
print(series_obj[2])
print(series_obj[4])

2
4

In [128]:
print(series_obj[[2,5]])
print(series_obj[[1,6]])

row3    2
row6    5
dtype: int32
row2    1
row7    6
dtype: int32

In [129]:
# data frame
np.random.seed(5)
DF_obj = DataFrame(np.random.rand(36).reshape((6,6)),
                  index = ['row1', 'row2', 'row3', 'row4','row5', 'row6'],
                  columns = ['col 1', 'col 2', 'col 3', 'col 4','col 5', 'col 6'])
DF_obj

         col 1     col 2     col 3     col 4     col 5     col 6
row1  0.221993  0.870732  0.206719  0.918611  0.488411  0.611744
row2  0.765908  0.518418  0.296801  0.187721  0.080741  0.738440
row3  0.441309  0.158310  0.879937  0.274086  0.414235  0.296080
row4  0.628788  0.579838  0.599929  0.265819  0.284686  0.253588
row5  0.327564  0.144164  0.165613  0.963931  0.960227  0.188415
row6  0.024307  0.204556  0.699844  0.779515  0.022933  0.577663

In [130]:
DF_obj.loc[['row2', 'row5'], ['col 5', 'col 3']]

         col 5     col 3
row2  0.080741  0.296801
row5  0.960227  0.165613

In [131]:
DF_obj.loc[['row1'],['col 2', 'col 3']]

         col 2     col 3
row1  0.870732  0.206719

In [132]:
# data slicing
series_obj['row3': 'row7']

row3    2
row4    3
row5    4
row6    5
row7    6
dtype: int32

In [133]:
DF_obj < .3

      col 1  col 2  col 3  col 4  col 5  col 6
row1   True  False   True  False  False  False
row2  False  False   True   True   True  False
row3  False   True  False   True  False   True
row4  False  False  False   True   True   True
row5  False   True   True  False  False   True
row6   True   True  False  False   True  False

In [134]:
s1 = series_obj > 5
print(s1)
# filtering with scalers
ss1 = series_obj[series_obj > 5]
print(ss1)

row1    False
row2    False
row3    False
row4    False
row5    False
row6    False
row7     True
row8     True
dtype: bool
row7    6
row8    7
dtype: int32

In [135]:
# setting values with scalars
series_obj['row1', 'row3', 'row5'] = 7
series_obj

row1    7
row2    1
row3    7
row4    3
row5    7
row6    5
row7    6
row8    7
dtype: int32

# The End